In [ ]:
%cd ..
from google.colab import drive
drive.mount('/content/gdrive')

/
Mounted at /content/gdrive

Data Collection and Datasets

From .csv Files

From Excel Files

From SQL Files

 **`*From .CSV File *`**

In [5]:
# From csv
import pandas as pd
EmpId = [101,102,103,104,105]
FName = ['Manoj','Rahul','Satish','Anita','Pooja']
LName = ['Yadav','Rai','Dubey','Shindey','Jha']
Age = [23,30,25,21,35]
Designation=['ProjectEngineer','Tester','Software','Webdeveloper','Manager']
BasicSalary = [40000,35000,50000,52000,60000]
joblist=zip(EmpId,FName,LName,Age,Designation,BasicSalary)
df=pd.DataFrame(data=joblist,columns=['EmpId','FName','LName','Age','Designation','BasicSalary'])
df.to_csv('Job.csv',index=True,header=False)
df

   EmpId   FName    LName  Age      Designation  BasicSalary
0    101   Manoj    Yadav   23  ProjectEngineer        40000
1    102   Rahul      Rai   30           Tester        35000
2    103  Satish    Dubey   25         Software        50000
3    104   Anita  Shindey   21     Webdeveloper        52000
4    105   Pooja      Jha   35          Manager        60000

In [8]:
import pandas as pd
location="result.csv"
df=pd.read_csv(location)
df.head()

   Roll no.     Name  Subj1  Subj2  subj3  total result
0       101   Manoj      45     45     45    135      P
1       102   Manish     35     45     42    122      P
2       103  shubham     29     26     30     85      P
3       104   shivam     38     35     29    102      P
4       105   aakash     41     40     34    115      P

**From excel**

In [7]:
#from excel
import pandas as pd
EmpId = [101,102,103,104,105]
FName = ['Manoj','Rahul','Satish','Anita','Pooja']
LName = ['Yadav','Rai','Dubey','Shindey','Jha']
Age = [23,30,25,21,35]
Designation=['ProjectEngineer','Tester','Software','Webdeveloper','Manager']
BasicSalary = [40000,35000,50000,52000,60000]
joblist=zip(EmpId,FName,LName,Age,Designation,BasicSalary)
df=pd.DataFrame(data=joblist,columns=['EmpId','FName','LName','Age','Designation','BasicSalary'])
df.to_csv('Job.xlsx',index=True,header=False)
df

   EmpId   FName    LName  Age      Designation  BasicSalary
0    101   Manoj    Yadav   23  ProjectEngineer        40000
1    102   Rahul      Rai   30           Tester        35000
2    103  Satish    Dubey   25         Software        50000
3    104   Anita  Shindey   21     Webdeveloper        52000
4    105   Pooja      Jha   35          Manager        60000

In [11]:
import pandas as pd
location="result.xlsx"
df=pd.read_excel(location)
df.head()

   Roll no.     Name  Subj1  Subj2  subj3  total result
0       101   Manoj      45     45     45    135      P
1       102   Manish     35     45     42    122      P
2       103  shubham     29     26     30     85      P
3       104   shivam     38     35     29    102      P
4       105   aakash     41     40     34    115      P

**From Sql**

In [21]:
import pandas as pd 
import os
import sqlite3 as lite
from sqlalchemy import create_engine

sales_Representative=["sara","farahan","patrick","francheska","Henry","preson"]
Location=["New_York","Oregon","New_Jersy","New_York","Washington","Oregon"]
Region=["East","west","East","East","West","East"]
Customer=["Justin","Roy","Aian","Franklin","Danie","Phyllis"]
Item=["Watch","Mobile","Stationary","Jeans","Mobile","TV"]
Quantity=[2,1,15,2,1]
Price=[1000,25000,500,5750,10000,50000]

saledata = zip(sales_Representative,Location,Region,Customer,Item,Quantity,Price)
df = pd.DataFrame(data =saledata, columns=['sales_Representative','Location','Region','Customer','Item','Quantity','Price'])

 
db_filename = r'salesmandata.db'
con = lite.connect(db_filename)
df.to_sql('salesman',
con,
schema=None,
if_exists='replace',
index=False,
index_label=None,
chunksize=None,
dtype=None)
con.close()


db_file = r'salesmandata.db'
engine = create_engine(r"sqlite:///{}" .format(db_file))
sql = 'SELECT * from salesman '


saledf = pd.read_sql(sql, engine)
saledf

  sales_Representative    Location Region  ...        Item Quantity  Price
0                 sara    New_York   East  ...       Watch        2   1000
1              farahan      Oregon   west  ...      Mobile        1  25000
2              patrick   New_Jersy   East  ...  Stationary       15    500
3           francheska    New_York   East  ...       Jeans        2   5750
4                Henry  Washington   West  ...      Mobile        1  10000

[5 rows x 7 columns]

In [38]:
import sqlite3
conn = sqlite3.connect('sql-employee.db')
#sql = 'SELECT * from employee'

db_file = r'sql-employee.db'
engine = create_engine(r"sqlite:///{}" .format(db_file))
sql = 'SELECT * from employee'


saledf = pd.read_sql(sql, engine)
saledf

    id          name  donation location  status
0  102     Adil Null    5500.0    India       1
1  103  Abbas connti    6500.0    India       1
2  104     Abzi Book    7000.0    India       0

 **Data Preprocessing (Data Preparation and Data Transformations)

Missing Values

Group By

Merge

Transform

Apply**

In [56]:
import pandas as pd
location="result.csv"
df=pd.read_csv(location)
df.head()

   Roll no.     Name  Subj1  Subj2  subj3  total result
0       101   Manoj      45     45     45    135      P
1       102   Manish     35     45     42    122      P
2       103  shubham     29     26     30     85      P
3       104   shivam     38     35     29    102      P
4       105   aakash     41     40     34    115      P

In [43]:
# missing value
print(df.isnull().sum())

Roll no.    0
Name        0
Subj1       0
Subj2       0
subj3       0
total       0
result      0
dtype: int64

In [48]:
#groupby
newdata =df.groupby("Roll no.")["result","Name"]
print(newdata.head())

  result     Name
0      P   Manoj
1      P   Manish
2      P  shubham
3      P   shivam
4      P   aakash
5      P   ritwik
6      P  saurabh
7      P   nilesh
8      P  prakash
9      P  vikrant

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.

In [52]:
import pandas as pd

ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

grouped = df.groupby('Year')
for name,group in grouped:
   print (name)
   print (group)

2014
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
2015
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804
2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

In [54]:
# merge
import pandas as pd
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame({
	'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})
print (pd.merge(left,right,on='id'))

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

In [60]:
import pandas as pd
location="result.csv"
df=pd.read_csv(location)
df.head()

   Roll no.     Name  Subj1  Subj2  subj3  total result
0       101   Manoj      45     45     45    135      P
1       102   Manish     35     45     42    122      P
2       103  shubham     29     26     30     85      P
3       104   shivam     38     35     29    102      P
4       105   aakash     41     40     34    115      P
5       106   ritwik     46     62     41    149      P
6       107  saurabh     29     48     27    104      P
7       108   nilesh     43     33     33    109      P
8       109  prakash     37     30     38    105      P
9       110  vikrant     33     31     41    105      P

In [58]:
#apply
def some_func(x):
  return x*2
df.apply(some_func) #update each entry of dataframe without any loop
df.apply(lambda n: n*2) #lambda also works the same

   Roll no.            Name  Subj1  Subj2  subj3  total result
0       202    Manoj Manoj      90     90     90    270     PP
1       204    ManishManish     70     90     84    244     PP
2       206  shubhamshubham     58     52     60    170     PP
3       208    shivamshivam     76     70     58    204     PP
4       210    aakashaakash     82     80     68    230     PP
5       212    ritwikritwik     92    124     82    298     PP
6       214  saurabhsaurabh     58     96     54    208     PP
7       216    nileshnilesh     86     66     66    218     PP
8       218  prakashprakash     74     60     76    210     PP
9       220  vikrantvikrant     66     62     82    210     PP

In [64]:
# importing pandas as pd
import pandas as pd

# Creating the DataFrame
df = pd.DataFrame({"A":[12, 4, 5, None, 1],
				"B":[7, 2, 54, 3, None],
				"C":[20, 16, 11, 3, 8],
				"D":[14, 3, None, 2, 6]})

# Create the index
index_ = ['Row_1', 'Row_2', 'Row_3', 'Row_4', 'Row_5']

# Set the index
df.index = index_

# Print the DataFrame
print(df)

          A     B   C     D
Row_1  12.0   7.0  20  14.0
Row_2   4.0   2.0  16   3.0
Row_3   5.0  54.0  11   NaN
Row_4   NaN   3.0   3   2.0
Row_5   1.0   NaN   8   6.0

In [66]:
#transform
# add 10 to each element of the dataframe
result = df.transform(func = lambda x : x + 10)

# Print the result
print(result)

          A     B   C     D
Row_1  22.0  17.0  30  24.0
Row_2  14.0  12.0  26  13.0
Row_3  15.0  64.0  21   NaN
Row_4   NaN  13.0  13  12.0
Row_5  11.0   NaN  18  16.0